Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Disable IDE Transitions: The GameMaker Studio 2 IDE has a number of animated transitions for things like opening windows etc... however they are not to everyone's taste and you may experience a performance boost if they are disabled on older or underpowered machines if they are disabled.
zh_cn: 禁用IDE切换效果（Disable IDE Transitions）：GameMaker Studio 2的IDE有一些动画切换效果。例如打开窗口等……然而这些效果并不是所有人的菜并且如果在老式或者低功耗机器上禁用这些效果你也可能得到性能的提升。

source: Disable IDE transition animations: The GameMaker Studio 2 IDE has a number of animated transitions for things like opening windows etc... however they are not to everyone's taste and you may experience a performance boost if they are disabled on older or underpowered machines if they are disabled.
zh_cn: 禁用IDE过渡动画: GameMaker Studio 2 IDE 在打开窗口等情况会有过渡动画，然而并不是每个人都喜欢过渡动画，如果在旧电脑或性能不足的电脑上禁用该选项，可能可以体验到性能的提升。

source: Dismiss dragging resources into a locked or invisible layer error - Here you can choose what happens when you drag a resource onto a layer that has been locked or is flagged as invisible.
zh_cn: 忽略拖拽资源到锁定或不可见层的错误（Dismiss dragging resources into a locked or invisible layer error） - 在这里你可以选择当你拖拽一个资源到房间层而这个层已经锁定或者不可见时会发生什么。

source: Dismiss dragging resources with multiple or no selected layers - Here you can choose what happens when you drag a resource onto the room editor when you have selected multiple layers in the layer editor (or have not selected any layer at all).
zh_cn: 忽略拖拽资源到多层或未选中层的错误（Dismiss dragging resources with multiple or no selected layers） - 在这里你可以选择当你拖拽一个资源到房间编辑器中，此时选中了多个层或者没有选中任何层时会发生什么。

source: Dismiss group selected warning - If you select multiple layers in the layer editor and then try to draw or edit then you will be shown a message by default to inform you that it is not possible.
zh_cn: 忽略选定组警告（Dismiss group selected warning） - 当你在图层编辑器中选择多个涂层并开始绘制或编辑的时候，编辑器会弹出一个消息告诉你这样不可以。

source: Dismiss invalid resource being dragged into room error - If you try to add a resource to a layer that is not designated as being for that resource type (like adding a sprite to a path layer), then you will be shown a message by default to inform you that it can't be done.
zh_cn: 忽略无效资源拖拽到房间的错误（Dismiss invalid resource being dragged into room error） - 如果你尝试添加一个资源到一个层，但是那个层不是为那个资源类型设计的（如果添加一个精灵到路径层），那么默认你将看到一条消息，通知你不能这样做。

source: Dismiss item locked warning - If you try to delete an item it happens to be locked, you will be shown a message by default.
zh_cn: 解除项目锁定警告（Dismiss item locked warning） - 如果你尝试删除一条项目，而它碰巧被锁定，默认，你将看到一条消息。

source: Dismiss item's owner layer locked warning - If you try to delete an item on a layer and the layer happens to be locked (even if the item is not), then you will be shown a message by default to inform you that it can't be done.
zh_cn: 解除项目所属层的锁定的警告（Dismiss item's owner layer locked warning） - 如果你删除层中的一个项目，碰巧层被锁定了（即使该项目没有被锁定），然后默认你将看到一条消息，通知你不能这样做。

source: Dismiss layer is locked warning - If you try to edit a locked layer you'll get a message by default informing you that you can't do this.
zh_cn: 忽略图层锁定警告（Dismiss layer is locked warning） - 如果你在尝试去编辑一个锁定的图层，那么你会默认地得到一个消息告诉你你无法这样做。

source: Dismiss layer locked warning - If you try to delete a layer in the room and it happens to be locked, you will be shown a message by default.
zh_cn: 解除层锁定警告（Dismiss layer locked warning） - 如果你尝试删除一房间层，而它碰巧被锁定，默认情况你将看到一条消息。

source: Display Grid - If this is checked then the Image Editor will open with the image grid on.
zh_cn: 显示网格 - 勾选此项则图像编辑器会自动带上网格地打开图像。

source: Display Grid - This option will toggle on or off the room grid when you first open a room.
zh_cn: 显示网格（Display Grid） - 首次打开一个房间，这个选项将切换房间网格的显示。

source: Display argument descriptions in status bar: If this is checked then any descriptions you have given your custom scripts using the JSDoc notation will be shown in the status bar at the bottom of the editor window.
zh_cn: 在状态栏中显示参数描述：勾选该选项之后你在自定义脚本中使用JSDoc标记给出的描述都会在编辑器窗口底部的状态栏中显示出来。

source: Display argument types in status bar: This option relates to when you are using your own custom scripts and have used JSDoc notation to identify the different arguments, etc... (see here for more information).
zh_cn: 在状态栏中显示参数类型：该选项关系到在你使用你自己的被JSDoc标注过的自定义脚本（Script）时是否显示各种参数等……（详情请见 这里）

source: Display grid - This option will toggle on or off the room grid when you first open a room.
zh_cn: 显示网格 - 当您首次打开场景时，此选项可控制默认打开或关闭场景网格。

source: Display only currently open windows: Enabling this will make the Recent Windows list remove those items that are no longer open in a workspace (ie: closing any window will remove it from the list too).
zh_cn: 仅显示当前打开的窗口: 启用该选项时，最近窗口列表会删除不再在工作区中打开的项（即：关闭窗口会从列表中删除这些项）。

source: Distance tab must be dragged to un-maximise the desktop: When you drag a workspace tab away from its default position within the IDE, if there is only one workspace active at that time then the GameMaker Studio 2 window will un-maximise and move with the mouse (if you have more than one workspace active a new instance of the IDE will be created to hold the workspace).
zh_cn: 还原窗口所需要拖拽标签页的距离（Distance tab must be dragged to un-maximise the desktop）：当你将一个工作区标签从IDE中的默认位置拖拽出来时，如果与此同时只有一个活动工作区，则GameMaker Studio 2的窗口会被还原并跟随鼠标移动（如果你有多个活动工作区，则会创建一个新的IDE实例窗口来承载这个工作区）。

source: DnD™ node overview visibility mode: A node "overview" is the short descriptive text that appears beside certain actions in the Action Workspace, for example this Destroy Instance action: You can choose to enable these always, enable them only if the action is collapsed (the default setting), or disable them altogether.
zh_cn: DnD™ 节点概述可见模式: 节点“概述”是出现在动作工作区中的某些操作旁边的简短描述性文本，例如 Destroy Instance 这个动作： 你可以选择总是启用、仅在动作折叠时显示（默认设置）或完全禁用。

source: DnD™ toolbox default location: By default the DnD™ toolbox (where all the different action libraries are held) is placed on the right of the Editor, but you can use this option to have it default to the left.
zh_cn: DnD™ 工具栏默认位置: 默认情况下 DnD™ 工具栏 (其中保存了所有不同的动作库) 位于编辑器的右侧，但是你可以使用此选项将其默认设置为左侧。

source: Document line limit: Set the maximum number of lines for any given editor document.
zh_cn: 文档行限制（<=0 表示不限）：设置任意给定的编辑器文档的行数的最大数目。

source: Draw thin selection outline: If this is checked then the outline for selections will be an absolute 1px in width, regardless of the scale of the image, while having it un-checked will make the selection outline a relative 1px in width and scale with the image.
zh_cn: 绘制细的选区边框（Draw thin selection outline）：如果你勾选此项，则选区的边框将会是无视图像缩放的绝对的1像素宽，而解除此选项则使得边框为相对于图像缩放的1像素宽。

source: Duplicate Event - Duplicate the chosen event.
zh_cn: 重复事件 - 复制所选事件。

source: Duplicate - Create a duplicate of the resource that has been clicked.
zh_cn: 复制 - 创建所点击资源的副本。

source: Editor background colour: While editing a sprite frame the image may be scaled in or out or may not fit the whole drawing in window, in which case a background colour will be shown which you can set here.
zh_cn: 编辑器背景颜色: 在编辑精灵帧时，图像可能被放大或缩小，或者可能没有填满整个绘制窗口，这种情况下，你可以在这里设置背景颜色。

source: Email to commit as: The email that is associated with this Git identity.
zh_cn: 提交的邮箱地址：与此Git身份关联的邮箱。

source: Enable DPI Override: This option lets you override the default DPI setting with your own.
zh_cn: 启用DPI改写: 此选项允许你自己改写默认的DPI设置。

source: Enable Mask Overlay For Point Insertion - Enable or disable the mask overlay option.
zh_cn: 为点插入启用蒙版覆盖（Enable Mask Overlay For Point Insertion） - 启用或禁用蒙版覆盖选项。

source: Enable adding brackets () to functions: Enable or disable the automatic addition of brackets () when you use the autocomplete.
zh_cn: 启用函数添加括号()：当使用自动补全时启用或者禁用自动添加括号()。

source: Enable code completion: Enable or disable the code completion window.
zh_cn: 启用代码自动补全：启用或者禁用代码补全窗口。

source: Enable colour coding: Enable or disable colour coding for the editor.
zh_cn: 启用颜色代码（语法高亮）：启用或禁用编辑器的颜色编码。

source: Enable notifications: Checking this will enable the IDE to show notifications about new runtimes, etc...
zh_cn: 启用消息通知: 勾选此项IDE将在有新的运行时等情况显示通知。

source: Enable real-time debugging: Checking this option will permit you to debug your game projects in real time as you run them from the IDE.
zh_cn: 应用实时调试: 此选项允许你从IDE运行游戏项目时实时调试游戏项目。

source: Exit - Exit GameMaker Studio 2 to the desktop.
zh_cn: 退出（Exit） - 退出 GameMaker Studio 2 到桌面。

source: Export Project - This will export the project as a single *.yyz file.
zh_cn: 导出项目（Export Project） - 该选项将会把项目导出为一个单独的*.yyz文件。

source: Extensions - 0
zh_cn: 扩展（Extensions） - 0

source: FPS - This is the "Frames per Second" of your game, and basically shows how fast your game is running.
zh_cn: FPS - 这是你的游戏的“每秒帧数”，基本上代表了你的游戏的运行速度。

source: File watcher frequency (ms): This is the frequency that the file watcher will run at when on desktop (or a docked laptop).
zh_cn: 文件监视频率（毫秒）: 文件监视器运行的频率。

source: File: Here you can attempt to reconnect the debug module to your game should the connection be lost, or exit the debug module (which will not exit your game, only the module).
zh_cn: File:当你的游戏和调试模块连接断掉的时候，你可以在此尝试重连接，或者也可以在此选择退出调试模块。（不过这样不会退出游戏，仅仅是调试模块而已）

source: Font Name: The name of the font to use (available fonts will depend on those installed on your system).
zh_cn: 字体名称（Font Name）：所使用的字体名称（所可用的字体取决于安装在你系统上的字体）。

source: Fonts - 5 (no dynamic font creation permitted)
zh_cn: 字体（Fonts） - 5 （不允许创建动态字体）

source: Gadget - Gadget shortcuts are very specific and will only work when using a single gadget (the colour picker, for example).
zh_cn: 部件 - 部件快捷键是仅针对于单独一个控件部件（例如，取色器）生效的快捷键

source: GameMaker Community - This will open the GameMaker Community forums in your browser.
zh_cn: GameMaker 社区 - 在浏览器中打开 GameMaker 交流论坛。

source: Generate Project Images - Opens the Generate Project Images window.
zh_cn: 生成项目图 - 打开 生成项目图 窗口。

source: Global - Global shortcuts are those that work no matter where you are in the GameMaker Studio 2 IDE, unless your focus is on a specific window or gadget which overrides it.
zh_cn: 全局 - 全局快捷键是那些你在 GameMaker Studio 2 IDE 中无论什么位置都能生效的快捷键，除非你选择了一个覆盖了它的某个窗口或部件.

source: Go to the Marketplace - Open the Marketplace window where you can browse for assets.
zh_cn: 前往市场（Go to the Marketplace） - 打开市场窗口，在这个窗口里你可以浏览资源。

source: Green - Input / Output processing (ie: keyboard, mouse, gamepad, networking etc...)
zh_cn: 绿色 - 输入/输出处理（即：键盘，鼠标，游戏手柄，网络等）

source: Grey - The time required to clear screen each draw step
zh_cn: 灰色 - 清除屏幕每个绘制步骤所需的时间

source: Greyscale - Desaturate the image by a determined amount.
zh_cn: 灰阶（Greyscale） - Desaturate the image by a determined amount.

source: Grid horizontal spacing (px) - This value sets the spacing for the horizontal lines of the image grid.
zh_cn: 网格水平间距（像素） - 设置图片网格的水平线条间距。

source: Grid horizontal spacing (px) - This will set the horizontal space for gird cells of the room grid in pixels.
zh_cn: 网格水平间距（像素） - 这将以像素为单位设置场景网格的单元格水平空间。

source: Grid line Colour - Here you can set the colour (including alpha value) for the image grid.
zh_cn: 网格线颜色 - 在这里你可以设置网格线的颜色（包括透明度）。

source: Grid line colour - This option permits you to set the colour (including the alpha component) of the room grid lines.
zh_cn: 网格线颜色 - 此选项允许您设置场景网格线的颜色（包括 Alpha 值）。

source: Grid vertical spacing (px) - This value sets the spacing for the vertical lines of the image grid.
zh_cn: 网格垂直间距（像素） - 设置图片网格的垂直线条间距。

source: Grid vertical spacing (px) - This will set the vertical space for gird cells of the room grid in pixels.
zh_cn: 网格垂直间距（像素） - 这将以像素为单位设置场景网格的单元格垂直空间。

source: HTML5 - If you have chosen to build HTML5, then an index.html file (this is the default name, but you can give your own name too in the Platform Preferences) along with a folder containing your games files will be created and saved to the specified location.
zh_cn: HTML5 - 如果您选择构建 HTML5，则会使用index.html 文件（这是默认名称，您也可以在“平台首选项”中改为自己想要的名称），并将创建包含游戏文件的文件夹并将其保存到指定的位置。

source: Help manual port: This sets the port number for the manual micro web server to use.
zh_cn: 帮助文档端口: 设置访问文档微型网络服务器时使用哪个端口。

source: Hide DnD™ node overview panel: Here you can choose to hide the overview panel of the Action Code Editor.
zh_cn: 隐藏 DnD™ 节点概述面板: 使用该选项你可以隐藏动作代码编辑器的概述面板。

source: Highlight Colour For Inherited Tiles: Sets the highlight colour for a tile that has been inherited from a parent room.
zh_cn: 继承图块的高亮颜色（Highlight Colour For Inherited Tiles）：对于已经继承自一个父房间的图块，设置它的高亮颜色。

source: Highlight selection matches: This will lightly highlight any section of code that is duplicated elsewhere.
zh_cn: 高亮选区匹配: 这将轻轻地突出显示其他地方重复的所有代码段。

source: Highlight symbol pairs: This will highlight any pair of symbols in a section of code when one symbol is selected, for example, if you select the first bracket on a code block "{" the corresponding bracket "}" will be highlighted too.
zh_cn: 高亮显示成对符号：当选中一个符号时，这将突出显示任何成对的符号，比如，如果你选中一个代码块的第一个括号“{”，对应的括号“}”也会高亮。

source: Highlight words which match selection: This will lightly highlight any section of code that is duplicated elsewhere.
zh_cn: 高亮选区文字：这将稍微高亮选中的代码。

source: Highlighted path segment colour - The colour to be used to highlight any selected path segments.
zh_cn: 高亮路径段颜色 - 用于设置突出显示所选路径段的颜色。

source: Horizontal pixel spacing - This value sets the spacing for the horizontal lines of the image grid.
zh_cn: 水平像素间隔（Horizontal Pixel Spacing） - 该值设置图像编辑器网格的水平线间距。

source: Horizontal pixel spacing - This will set the horizontal space for gird cells of the room grid in pixels.
zh_cn: 水平像素间距（Horizontal pixel spacing） - 这将以像素为单位设置房间网格的单元格水平间距。

source: Horizontal separator colour: The colour of the bar that separates each discreet resource type in the tree.
zh_cn: 水平分割线颜色: 在树中分割每个离散资源类型的线条的颜色。

source: How Many Segments Should Render Chains Have?: Here you can set the maximum number of segments for render chains.
zh_cn: 连接线需要渲染成多少段？（How Many Segments Should Render Chains Have?）：此处你可以设置渲染连接线所使用的最大段数。

source: IDE Language: This option permits you to select the language for the IDE from the list of options supplied.
zh_cn: IDE 语言: 此选项允许你从提供的选项列表中选择IDE语言。

source: IDE Skin: Here you can select from the different skins that the IDE can use.
zh_cn: IDE 皮肤: 在这里，你可以选择IDE的不同皮肤。

source: IDE cache directory: The location for saving the IDE cache.
zh_cn: IDE 缓存目录: 保存IDE缓存的目录位置。

source: IMPORTANT! Bookmarks are not saved with with the project or when the IDE is closed.
zh_cn: 重要! 书签 不 会与项目一起保存，当 IDE 关闭时也不会保存。

source: IMPORTANT! Due to the restrictions of the various NDAs associated with the console exports, there is no information about setting up or programming for these targets within the GameMaker Studio 2 manual.
zh_cn: 重要! 由于与控制台导出相关的各种保密协议的限制，在 GameMaker Studio 2 手册中没有关于为这些目标平台设置或编程的信息.

source: IMPORTANT! Exporting YYZ projects is not available with the Trial Licence of the product.
zh_cn: 重要！ 导出YYZ项目在试用版（Trial License）产品中 不 可用。

source: IMPORTANT! If the global variable you are getting does not exist then the function will return the keyword undefined and you may get errors that will stop the game from functioning, so if in doubt use the function variable_global_exists first.
zh_cn: 重要！如果你要取得的全局变量并不存在，那么该函数将会返回关键字undefined并且你可能会得到错误，阻止游戏的运转，因此如果你不够确定的话请先使用variable_global_exists函数。

source: IMPORTANT! If you have been using a Trial Licence for GameMaker Studio 2 and then buy one of the other licences (Creator, Desktop, Amazon Fire, Mobile, UWP, Web or Console) then you will need to log out of the IDE and restart GameMaker Studio 2.
zh_cn: 重要! 如果你为GameMaker Studio 2 使用了试用许可，并且购买了其他许可之一 (Creator, 桌面端, Amazon Fire, 移动端, UWP, 网页端或控制台) 那么你 需要在 GameMaker Studio 2 IDE 登出账号并重启.

source: IMPORTANT! If you have been using a Trial Licence for GameMaker Studio 2 and then buy one of the other licences (Desktop, Mobile, UWP, Web or Console) then you may need to log out of the IDE and then restart GameMaker Studio 2 and log back in again to make sure that the new licence is applied correctly (although this should happen automatically).
zh_cn: 重要！ 如果你已经使用一个 GameMaker Studio 2 的试用版许可证，然后买了一个其它许可证中的一个（桌面版、移动版、UWP、网页版或者控制台），然后你可能需要登出 IDE，接着重启 GameMaker Studio 2 之后再次登录以确保新的许可证正确应用（尽管这应该会自动生效）。

source: IMPORTANT! If you have been using a Trial Licence for GameMaker Studio 2 and then buy one of the other licences (Desktop, Mobile, UWP, Web or Console) then you will may to log out of the IDE and then restart GameMaker Studio 2 and log back in again to make sure that the new licence is applied correctly (although this should happen automatically).
zh_cn: 重要！ 如果你已经在使用一个 GameMaker Studio 2 的试用版许可证，然后买一个其它的许可证（桌面版、移动版、UWP、网页版或者控制台），然后你可能 需要登出IDE，接着重启GameMaker Studio 2，之后再次登录以确保新的许可证正确应用（尽管这应该会自动生效）。

source: IMPORTANT! Importing old projects and YYZ projects is not available with the Trial Licence of the product.
zh_cn: 重要！ 导入旧版项目和YYZ项目在试用版（Trial License）产品中不可用。

source: IMPORTANT! In a game made with GameMaker Studio 2, the characters, monsters, balls, walls, etc... are all instances copied from a basic object template that is found in the resource tree and then placed in a room.
zh_cn: 重要！ 在用 GameMaker Studio 2 制作的游戏中，角色，怪物，球，墙等等都是从资源树中找到的基本物体模板中复制的 实例，然后放置在一个房间中。

source: IMPORTANT! This function is not available with the Trial Licence of the product.
zh_cn: 重要！该函数在试用版（Trial License）产品中不可用。

source: IMPORTANT: It is recommended that you always clear the cache before creating the executable for any target platform.
zh_cn: 重要：建议您在为任何目标平台创建可执行文件之前，始终先清除缓存。

source: Icon: This section permits you to set the colour and alpha for the folder icons used to denote the different resource tree asset types.
zh_cn: 图标: 此部分允许您设置用于表示不同资源树资源类型的文件夹图标的颜色和 alpha值。

source: Image Scaling: This controls how the background image will be scaled within the different workspaces.
zh_cn: 图像尺度（Image Scaling）：该选项控制了背景图像在各个工作区下如何被缩放。

source: Immediately Open New Resources: If this is checked, every time you create a new resource in the Resource Tree, the corresponding resource editor will be opened automatically.
zh_cn: 立即打开新资源（Immediately Open New Resources）：如果此项被勾选，每次你在资源树创建新资源的时候，相应的资源编辑器会被自动打开。

source: Import Extension - Import an extension to your project (only available on the Extensions resource).
zh_cn: 导入扩展 - 导入扩展资源到您的项目（仅适用 扩展 资源）

source: Import Project - If you have a project made with the GameMaker Studio 2 1.4 software from YoYo Games, you can select this option to import either the *.gmx or the *.gmz file.
zh_cn: 导入项目（Import Project） - 如果你有使用来自YoYo Games的GameMaker Studio 1.4软件制作的项目，您可以选择该选项来导入*.gmx或*.gmz文件。

source: Import Project - If you have a project made with the GameMaker: Studio 1.4 software from YoYo Games, you can select this option to import either the *.gmx or the *.gmz file.
zh_cn: 导入项目 - 如果你有使用来自 YoYo Games 的 GameMaker: Studio 1.4 软件制作的项目，您可以选择该选项来导入 *.gmx 或 *.gmz 文件。

source: Included files - 0
zh_cn: 包含文件（Included Files） - 0

source: Initial default draw colour for new projects: When you use a font or draw a shape using the GameMaker Studio 2 functions or DnD™ actions without specifying a colour, the colour set here is the one that will be used.
zh_cn: 新项目的初始默认绘制颜色：当你使用 GameMaker Studio 2 的函数或拖拽按钮（DnD™）动作调用字体或绘制形状时若没有指定绘制颜色，则会使用此处的颜色。

source: Insert path point precision (px) - This sets the precision value (in pixels) for inserting points on a path, ie: the mouse must be within this range to insert the point rather than add a new one.
zh_cn: 插入路径点精度（像素） - 设置在路径上插入点的精度值（以像素为单位），即：鼠标必须在此精度范围内才能插入点，而不是添加新的点。

source: Invalid anchor points colour - The colour to be used to draw the path anchor points.
zh_cn: 无效锚点颜色 - 设置用于绘制路径无效锚点的颜色。

source: Invalid path colour - The colour to be used to highlight a path that is not valid.
zh_cn: 无效路径颜色 - 用于设置突出显示无效路径的颜色。

source: JavaScript: The JavaScript target will only be available for a few targets, like the HTML5 target, and sets the game to be compiled to pure JavaScript.
zh_cn: JavaScript：JavaScript只能用于几种目标，例如HTML5，并将游戏编译为纯JavaScript 代码。

source: Keep tabs: If checked, this will keep tab key presses as tab characters - '\t' - in the editor, while unchecked means that tabs are converted into spaces.
zh_cn: 保持tab键缩进对齐：如果选中， 这将使编辑器中按下tab键作为tab字符-‘\t’，而不选中则表示tabs转化为空格?。

source: Knowledge Base - This will take you to the GameMaker Studio 2 Help Center where you can find articles on platform setup, known issues, using GameMaker Studio 2 and a number of other things.
zh_cn: 知识库 - 这将带您进入 GameMaker Studio 2 帮助中心，在这里您可以使用 GameMaker Studio 2 和其他一些功能查找有关平台设置，已知问题的文章。

source: Label: The "label" is the text is used to describe or name the node or item in the resource tree, and here you can change the colour of the text as well as the font and styling to be used for it.
zh_cn: 标签: “标签”是用于描述或命名资源树中的节点或项目的文本，此处可以更改文本的颜色以及字体和样式。

source: Laptop file watcher frequency (ms): This is the frequency that the file watcher will run at when in laptop mode.
zh_cn: 笔记本电脑文件监视频率（毫秒）: 文件监视器在笔记本模式下运行的频率。

source: Layer Editor: Everything in a room is placed on layers, and there are different layer types that you can choose from (more on this later).
zh_cn: 层编辑器: 房间中的所有东西都放在 层上，而且有不同的层类型可以选择（稍后会详细介绍）。

source: Layer Properties: Each layer that you add to the room will have its own properties, and those properties will change depending on the layer type.
zh_cn: 层属性: 您添加到房间的每个层都具有自己的属性，并且这些属性将根据层类型而改变。

source: Line Colour - Here you can set the colour (including alpha value) for the image grid.
zh_cn: 网格线颜色（Line Colour） - 在此处你可以设置图像网格的颜色（包括透明度值）。

source: Line Colour - This option permits you to set the colour (including the alpha component) of the room grid lines.
zh_cn: 线条颜色（Line Colour） - 这个选项允许你设置房间网格线的颜色（包括透明度分量）。

source: Load Layout - This will open a file explorer where you can select a previously saved layout *.xml file for loading.
zh_cn: 载入布局（Load Layout） - 该选项会打开一个文件资源管理器，在这里你可以选择载入之前被保存过的 *.xml 布局文件。

source: Logout on exit: If this option is checked then the IDE will automatically log out the user session when GameMaker Studio 2 is closed.
zh_cn: 退出时登出: 如果勾选该选项那么当你关闭 GameMaker Studio 2 时会登出账号。

source: Logout - Selecting this will log you out of GameMaker Studio 2.
zh_cn: 注销（Logout） - 选择该项将会让你登出 GameMaker Studio 2。

source: Mac OS - The Mac OS target will build either an *.app file or a *.pkg file, depending on whether you want to later upload it to the Mac App Store or not.
zh_cn: Mac OS - Mac OS 将构建 *.app文件或 *.pkg文件，具体取决于您是否要将其上传到Mac App Store。

source: Mask Overlay Colour - Set the overlay colour for masks if they are enabled (see above).
zh_cn: 蒙版遮罩颜色（Mask Overlay Colour - 如果启用于蒙版覆盖，设置遮罩的颜色。

source: Mask overlay colour - Set the overlay colour for masks if they are enabled (see above).
zh_cn: 蒙版覆盖区域颜色 - 如果启用蒙版，请设置蒙版的覆盖颜色（见上文）。

source: Match indent on new lines: Enable or disable auto-indentation for your code.
zh_cn: 在另起行保持缩进：启用或者禁用你代码的自动缩进。

source: Maximum amount of recently used actions: In the action toolbox there is a library at the top which holds the actions you have most recently used.
zh_cn: 最近使用动作的最大数量（Maximum amount of recently used actions）：在动作工具箱的顶端有一个库，其持有你最近使用过的动作按钮。

source: Maximum number of recently used actions to display: In the action toolbox there is a library at the top which holds the actions you have most recently used.
zh_cn: 最近使用动作的最大显示数目: 在动作工具栏的顶部有一个最近使用动作的收藏夹。

source: Maximum number of resources open simultaneously before warning: You can select multiple resources for opening at a time by using + to select them and then right clicking and choosing open all.
zh_cn: 发生警告前同时打开资源的最大数目（Maximum number of resources open simultaneously before warning）：你可以使用 + 同时选择多个资源然后右键点击并选择打开全部（open all）一次性打开。

source: Maximum number of resources open simultaneously without warning: You can select multiple resources for opening at a time by using / + to select them and then right clicking and choosing open all.
zh_cn: 在没有警告的情况下同时打开的最大资源数: 您可以使用 / + 一次选择多个资源，然后单击 并选择全部打开。

source: Maximum number of search results to display: This option controls the maximum number of returned results when you use the Go To search window.
zh_cn: 要显示的最大搜索结果数：该选项控制着你使用前往搜索窗口时返回搜索结果的最大数量。
